app/controllers/billing_controller.rb

INSERT INTO `billings` (`emp_id`, `month_name`, `year`, `is_billable`, `created_at`, `updated_at`) VALUES (2, 'mar', NULL, FALSE, '2024-03-11 04:43:12.943589', '2024-03-11 04:43:12.943589')
INSERT INTO `resources` (`emp_id`, `month_name`, `year`, `is_billable`, `created_at`, `updated_at`) VALUES (4, 'apr', NULL, TRUE, '2024-03-14 05:45:18.566268', '2024-03-14 05:45:18.566268')
---
  def create
    permitted_params = billing_params
    is_billable_param = permitted_params[:is_billable]
    converted_is_billable = convert_is_billable_param(is_billable_param)
    billing = Resource.new(permitted_params.merge(is_billable: converted_is_billable))
    if billing.save

SELECT `resources`.* FROM `resources` WHERE `resources`.`emp_id` = 1 AND `resources`.`month_name` = 'feb' LIMIT 1
UPDATE `billings` SET `billings`.`emp_id` = 12, `billings`.`month_name` = 'jan', `billings`.`updated_at` = '2024-03-12 05:25:20.500248' WHERE `billings`.`id` = 12
UPDATE `resources` SET `resources`.`is_billable` = TRUE, `resources`.`updated_at` = '2024-03-14 05:45:13.434155' WHERE `resources`.`id` = 18
---
  def update
    emp_id = params[:emp_id]
    month_name = params[:month_name]
    is_billable_param = params[:is_billable]
    converted_is_billable = convert_is_billable_param(is_billable_param)
    billing_record = Resource.find_by(emp_id: emp_id, month_name: month_name)
    if billing_record.update(is_billable: converted_is_billable)