app/controllers/employee_controller.rb

  def index
    employee_data = Employee.all
    billing_data=Resource.all
---
SELECT `employees`.* FROM `employees`
SELECT `resources`.* FROM `resources`

  def create
    employee = Employee.new(employee_params)

    if employee.save
---
INSERT INTO `employees` (`emp_name`, `created_at`, `updated_at`) VALUES ('C', '2024-03-11 06:55:31.779871', '2024-03-11 06:55:31.779871')